driver-tests/demo/demoJbi/test/demoTest/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tes="http://stc.com/TestBpel">
  <soapenv:Body>
    <tes:item>
      <tes:value>DemoTest</tes:value>
    </tes:item>
  </soapenv:Body>
</soapenv:Envelope>